In [1]:
#!pip install pandas
import pandas as pd
import numpy as np
print(pd.__version__)

2.2.0

- Pandas DataFrame --> use various ways to initialize it(dtype,columns,index)
- shape
- head
- tail
- columns
- to_csv (index = false)
- read_csv
-  drop(columns=[])
-  describe()
-  info()
-  iloc
-  loc
-  Access Particular Columns
-  indexing and slicing --> multirow and col
-  Filter
-  columns.get_loc
-  unique
-  sort_values(by,ascending)
-  convert to numpy array --> values

In [20]:
psa = pd.Series({'A':10,'B':20,'C':30})
print(psa)
psa.loc['A'] = 100
print(psa.loc['A'],psa.iloc[0])

A    10
B    20
C    30
dtype: int64
100 100

In [8]:
np.random.randint(1,100,(2,3))

array([[82, 75, 89],
       [78, 91,  8]])

In [9]:
d = {
    "MarksA":np.random.randint(1,100,5),
    "MarksB":np.random.randint(50,100,5),
    "MarksC":np.random.randint(70,90,5)}
d

{'MarksA': array([74, 96,  8,  6,  9]),
 'MarksB': array([69, 55, 71, 60, 90]),
 'MarksC': array([71, 78, 76, 71, 82])}

In [17]:
df = pd.DataFrame(d,columns = ["MarksA","MarksC","Phy"])
df

   MarksA  MarksC  Phy
0      74      71  NaN
1      96      78  NaN
2       8      76  NaN
3       6      71  NaN
4       9      82  NaN

In [14]:
# pd.DataFrame

In [2]:
na = np.random.randint(1,100,(5,3))
df = pd.DataFrame(na,columns=["Phy","Chem","Maths"]
                  ,index =[10,20,30,40,50])
df

    Phy  Chem  Maths
10   90    71     38
20   78    77     13
30   88    47      1
40   60    81     54
50   13    99      6

In [38]:
df.shape

(5, 3)

In [39]:
df.head(n=3)

    Phy  Chem  Maths
10   16    68     45
20   22    65     59
30   77    36     45

In [40]:
df.tail(n=3)

    Phy  Chem  Maths
30   77    36     45
40   30    58     51
50   12    93      6

In [41]:
df.columns

Index(['Phy', 'Chem', 'Maths'], dtype='object')

In [42]:
df.to_csv("Marks.csv")

In [50]:
df = pd.read_csv("Marks.csv",names=['a','b','c','d']
                 ,skiprows=1)
df

    a   b   c   d
0  10  16  68  45
1  20  22  65  59
2  30  77  36  45
3  40  30  58  51
4  50  12  93   6

In [51]:
df.drop(columns=["a"],inplace=True)
df

    b   c   d
0  16  68  45
1  22  65  59
2  77  36  45
3  30  58  51
4  12  93   6

In [68]:
df

    Phy  Chem  Maths
10   69    76     54
20   10    66     25
30   61    69      8
40    8    31     21
50    2    81     82

In [54]:
df.describe()

             Phy       Chem      Maths
count   5.000000   5.000000   5.000000
mean   30.000000  64.600000  38.000000
std    32.210247  19.679939  29.790938
min     2.000000  31.000000   8.000000
25%     8.000000  66.000000  21.000000
50%    10.000000  69.000000  25.000000
75%    61.000000  76.000000  54.000000
max    69.000000  81.000000  82.000000

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 10 to 50
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Phy     5 non-null      int32
 1   Chem    5 non-null      int32
 2   Maths   5 non-null      int32
dtypes: int32(3)
memory usage: 100.0 bytes

In [73]:
df[["Phy","Chem"]].iloc[[True,False,True,False,True]]

    Phy  Chem
10   69    76
30   61    69
50    2    81

In [77]:
df.loc[10:30]

    Phy  Chem  Maths
10   69    76     54
20   10    66     25
30   61    69      8

In [10]:
df.iloc[0:3,0:2].describe()

             Phy       Chem
count   3.000000   3.000000
mean   85.333333  65.000000
std     6.429101  15.874508
min    78.000000  47.000000
25%    83.000000  59.000000
50%    88.000000  71.000000
75%    89.000000  74.000000
max    90.000000  77.000000

In [12]:
df['Phy'].describe()

count     5.000000
mean     65.800000
std      31.815091
min      13.000000
25%      60.000000
50%      78.000000
75%      88.000000
max      90.000000
Name: Phy, dtype: float64

In [19]:
df[['Phy','Chem']][df['Phy'] >= 50]

    Phy  Chem
10   90    71
20   78    77
30   88    47
40   60    81

In [29]:
df[df['Phy'] >= 50]

    Phy  Chem  Maths
10   90    71     38
20   78    77     13
30   88    47      1
40   60    81     54

In [31]:
df.columns.get_loc('Phy')

0

In [34]:
na = np.array([[10,20,10,30,10],[100,30,100,10,40]]).T
df = pd.DataFrame(na)

In [35]:
df

    0    1
0  10  100
1  20   30
2  10  100
3  30   10
4  10   40

In [39]:
pd.unique(df[0])

array([10, 20, 30])

In [42]:
df[1].unique()

array([100,  30,  10,  40])

In [46]:
df.sort_values(by = [0,1],ascending=True)

    0    1
4  10   40
0  10  100
2  10  100
1  20   30
3  30   10

In [47]:
na = df.values
print(na,type(na))

[[ 10 100]
 [ 20  30]
 [ 10 100]
 [ 30  10]
 [ 10  40]] <class 'numpy.ndarray'>